artillery/test_cache_local/upload_shorts.txt
Test run id: tpah6_ek58p6xpq73xedaw48r3m5mjx9q3m_hn3d
Parsed 201 rows
Parsed 201 rows
Parsed 201 rows
[...]
Phase started: Warm up (index: 0, duration: 10s) 10:28:53(+0000)

Phase completed: Warm up (index: 0, duration: 10s) 10:29:03(+0000)

--------------------------------------
Metrics for period to: 10:29:00(+0000) (width: 5.069s)
--------------------------------------

http.codes.200: ................................................................ 11
http.codes.204: ................................................................ 11
http.downloaded_bytes: ......................................................... 3084
http.request_rate: ............................................................. 7/sec
http.requests: ................................................................. 22
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 47
  mean: ........................................................................ 13.8
  median: ...................................................................... 10.9
  p95: ......................................................................... 30.3
  p99: ......................................................................... 45.2
http.response_time.2xx:
  min: ......................................................................... 4
  max: ......................................................................... 47
  mean: ........................................................................ 13.8
  median: ...................................................................... 10.9
  p95: ......................................................................... 30.3
  p99: ......................................................................... 45.2
http.responses: ................................................................ 22
plugins.metrics-by-endpoint./rest/blobs/{{ blobUrl }}.codes.204: ............... 11
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd={{ pwd }}.codes.200: . 11
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 8
  max: ......................................................................... 45
  mean: ........................................................................ 16
  median: ...................................................................... 10.9
  p95: ......................................................................... 30.3
  p99: ......................................................................... 30.3
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 4
  max: ......................................................................... 47
  mean: ........................................................................ 11.6
  median: ...................................................................... 7
  p95: ......................................................................... 13.9
  p99: ......................................................................... 13.9
vusers.completed: .............................................................. 11
vusers.created: ................................................................ 11
vusers.created_by_name.Upload short: ........................................... 11
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 20.1
  max: ......................................................................... 95.4
  mean: ........................................................................ 37.9
  median: ...................................................................... 30.9
  p95: ......................................................................... 62.2
  p99: ......................................................................... 62.2


--------------------------------------
Metrics for period to: 10:29:10(+0000) (width: 4.12s)
--------------------------------------

http.codes.200: ................................................................ 19
http.codes.204: ................................................................ 19
http.downloaded_bytes: ......................................................... 5222
http.request_rate: ............................................................. 15/sec
http.requests: ................................................................. 38
http.response_time:
  min: ......................................................................... 5
  max: ......................................................................... 19
  mean: ........................................................................ 9.2
  median: ...................................................................... 7.9
  p95: ......................................................................... 16
  p99: ......................................................................... 16
http.response_time.2xx:
  min: ......................................................................... 5
  max: ......................................................................... 19
  mean: ........................................................................ 9.2
  median: ...................................................................... 7.9
  p95: ......................................................................... 16
  p99: ......................................................................... 16
http.responses: ................................................................ 38
plugins.metrics-by-endpoint./rest/blobs/{{ blobUrl }}.codes.204: ............... 19
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd={{ pwd }}.codes.200: . 19
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 7
  max: ......................................................................... 19
  mean: ........................................................................ 10.9
  median: ...................................................................... 10.1
  p95: ......................................................................... 16
  p99: ......................................................................... 16
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 5
  max: ......................................................................... 16
  mean: ........................................................................ 7.5
  median: ...................................................................... 6
  p95: ......................................................................... 13.9
  p99: ......................................................................... 13.9
vusers.completed: .............................................................. 19
vusers.created: ................................................................ 19
vusers.created_by_name.Upload short: ........................................... 19
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 15.8
  max: ......................................................................... 42.7
  mean: ........................................................................ 26.1
  median: ...................................................................... 23.3
  p95: ......................................................................... 38.5
  p99: ......................................................................... 38.5


All VUs finished. Total time: 10 seconds

--------------------------------
Summary report @ 10:29:05(+0000)
--------------------------------

http.codes.200: ................................................................ 30
http.codes.204: ................................................................ 30
http.downloaded_bytes: ......................................................... 8306
http.request_rate: ............................................................. 8/sec
http.requests: ................................................................. 60
http.response_time:
  min: ......................................................................... 4
  max: ......................................................................... 47
  mean: ........................................................................ 10.9
  median: ...................................................................... 8.9
  p95: ......................................................................... 19.1
  p99: ......................................................................... 45.2
http.response_time.2xx:
  min: ......................................................................... 4
  max: ......................................................................... 47
  mean: ........................................................................ 10.9
  median: ...................................................................... 8.9
  p95: ......................................................................... 19.1
  p99: ......................................................................... 45.2
http.responses: ................................................................ 60
plugins.metrics-by-endpoint./rest/blobs/{{ blobUrl }}.codes.204: ............... 30
plugins.metrics-by-endpoint./rest/shorts/{{ userId }}?pwd={{ pwd }}.codes.200: . 30
plugins.metrics-by-endpoint.response_time./rest/blobs/{{ blobUrl }}:
  min: ......................................................................... 7
  max: ......................................................................... 45
  mean: ........................................................................ 12.8
  median: ...................................................................... 10.9
  p95: ......................................................................... 19.1
  p99: ......................................................................... 30.3
plugins.metrics-by-endpoint.response_time./rest/shorts/{{ userId }}?pwd={{ pwd }}:
  min: ......................................................................... 4
  max: ......................................................................... 47
  mean: ........................................................................ 9
  median: ...................................................................... 6
  p95: ......................................................................... 13.9
  p99: ......................................................................... 16
vusers.completed: .............................................................. 30
vusers.created: ................................................................ 30
vusers.created_by_name.Upload short: ........................................... 30
vusers.failed: ................................................................. 0
vusers.session_length:
  min: ......................................................................... 15.8
  max: ......................................................................... 95.4
  mean: ........................................................................ 30.5
  median: ...................................................................... 26.3
  p95: ......................................................................... 42.5
  p99: ......................................................................... 62.2